package domain;

import dataset.Field;
import dataset.MetaField;
import dataset.Record;

public enum eArtTarif implements Field {
    up("0", "0", "0", "Тариф. мат. цености", "ARTSVST"),
    id("4", "10", "0", "Идентификатор", "id"),
    //anumb("12", "32", "1", "артикул", "ANUMB"),
    //ccode("4", "10", "1", "код_текстуры", "CLCOD"),
    //clnum("4", "10", "1", "??? Текстура", "CLNUM"),
    //cluni("4", "10", "1", "null", "CLUNI"),
    clprc("8", "15", "1", "тариф основной текстуры", "CLPRC"),
    knakl("8", "15", "1", "коэффициент накладных расходов", "KNAKL"),
    clprv("8", "15", "1", "тариф единицы измерения", "CLPRV"),
    clpr1("8", "15", "1", "тариф внутренний текстуры", "CLPR1"),
    clpr2("8", "15", "1", "тариф внешний текстуры", "CLPR2"),
    clpra("8", "15", "1", "тариф двухсторонний текстуры", "CLPRA"),
    askl1("12", "32", "1", "артикул склада", "ASKL1"),
    askl2("12", "32", "1", "артикул 1С", "ASKL2"),
    //cminp("8", "15", "1", "минимальный тариф", "CMINP"),
    cways("5", "5", "1", "галочки по приоритетности текстур (основной, внутренней, внешней): 0 - нет галочек (по всем текстурам этот цвет не основной для материала), 1 - галочка на внутренней текстуре, 2 - галочка на внешней текстуре, 3 - галочки на внутренней и внешней текстурах, 4 - галочка на основной текстуре, 5 - галочки на основной и внутреней текстурах, 6 - галочки на основной и внешней текстурах, 7 - галочки на всех текстурах (по всем текстурам основной цвет). ", "CWAYS"),
    artikl_id("4", "10", "1", "ссылка", "artikl_id"),
    texture_id("4", "10", "1", "ссылка", "texture_id");
    private MetaField meta = new MetaField(this);

    eArtTarif(Object... p) {
        meta.init(p);
    }

    public MetaField meta() {
        return meta;
    }

    public Field[] fields() {
        return values();
    }

    

    public String toString() {
        return meta.getDescr();
    }
}
