package enums;

/**
 * Типы мат. ценностей
 */
public enum TypeArtikl {

    X100(1, 0, "Профили"),
    X101(1, 1, "Коробка"),
    X102(1, 2, "Створка"),
    X103(1, 3, "Импост"),
    X104(1, 4, "Штульп"),
    X105(1, 5, "Стойка"),
    X106(1, 6, "Стыковочный"),
    X107(1, 7, "Армирование"),
    X108(1, 8, "Штапик"),
    X109(1, 9, "Фурнитуоа"),
    X110(1, 10, "Наличник водоотб."),
    X111(1, 11, "Доп. профиль"),
    X112(1, 12, "Раскладка"),
    X113(1, 13, "Подоконник"),
    X114(1, 14, "Отлив"),
    X115(1, 15, "Откос"),
    X116(1, 16, "Поперечина"),
    X117(1, 17, "Монтажный профиль"),
    X118(1, 18, "Деревянный брус"),
    X119(1, 19, "Эркер"),
    X120(1, 20, "Профиль в составе  М/С"),
    X121(1, 21, "Рама в составе стеклопакета"),
    X122(1, 22, "Профиль в составе роллеты"),
    X123(1, 23, "Профиль ламели"),
    X124(1, 24, "Вал"),
    X125(1, 25, "Шина"),
    X126(1, 26, "Короб"),
    X127(1, 27, "Концнвой профиль"),
    X128(1, 28, "Фиксирующий профиль"),
    X129(1, 29, "Усиливающий профиль"),
    X130(1, 30, "Ламель жалюзи"),
    X131(1, 31, "Профиль в жалюзи"),
    X132(1, 32, "Термомост"),
    X200(2, 0, "Аксессуары"),
    X201(2, 1, "Штучный эдемент"),
    X202(2, 2, "Закладной крепёж"),
    X203(2, 3, "Монтажный крепёж"),
    X204(2, 4, "Расходный материал"),
    X205(2, 5, "Соединитель"),
    X206(2, 6, "Концевик"),
    X207(2, 7, "Фурнитура замок"),
    X208(2, 8, "Фурнитура штучная"),
    X209(2, 9, "Фурнитура ручка"),
    X210(2, 10, "Фурнитура петля"),
    X211(2, 11, "Фурнитура дополнительная"),
    X212(2, 12, "Фурнитура накладная"),
    X213(2, 13, "Аксессуар в составе откосов"),
    X214(2, 14, "Аксессуар в составе М/С"),
    X215(2, 15, "Аксессуар в составе роллеты"),
    X216(2, 16, "Привод в составе роллеты"),
    X217(2, 17, "Аксессуар в составе жалюзи"),
    X218(2, 18, "Эксклюзив"),
    X300(3, 0, "Погонаж"),
    X301(3, 1, "Уплотнение притвора"),
    X302(3, 2, "Уплотнение заполнения"),
    X303(3, 3, "Лента"),
    X304(3, 4, "Шнур"),
    X305(3, 5, "Уплотнение в составе откосов"),
    X306(3, 6, "Уплотнение в составе М/С"),
    X307(3, 7, "Уплотнение в составе роллеты"),
    X308(3, 8, "Уплотнение в составе жалюзи"),
    X400(4, 0, "Инструмент"),
    X401(4, 1, "Инструмент"),
    X402(4, 2, "Амортизация"),
    X403(4, 3, "Аренда"),
    X500(5, 0, "Заполнения"),
    X501(5, 1, "Стекло"),
    X502(5, 2, "Стеклопакет"),
    X503(5, 3, "Сендвич"),
    X504(5, 4, "Вагонка"),
    X505(5, 5, "Алюминиевый лист"),
    X506(5, 6, "Специальное стекло"),
    X507(5, 7, "Конструктив"),
    X508(5, 8, "Тонируюшая плёнка"),
    X509(5, 9, "Бронирующая плёнка"),
    X510(5, 10, "Панель откоса"),
    X511(5, 11, "Москитная сетка (М/С)"),
    X512(5, 12, "Полотно жалюзи"),
    X513(5, 13, "Специальный тип (!)"),
    X514(5, 14, "Фиксированный блок");

   public int id1 = 0;
   public int id2 = 0;
   public String name = "";

    TypeArtikl(int id1, int id2, String name) {
        this.id1 = id1;
        this.id2 = id2;
        this.name = name;
    }
    
    public String toString() {
        return name;
    }
}
